<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 3 to add, 1 to change, 3 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_firebase_hosting_custom_domain.web will be created
  + resource "google_firebase_hosting_custom_domain" "web" {
      + cert                  = (known after apply)
      + cert_preference       = "GROUPED"
      + create_time           = (known after apply)
      + custom_domain         = "develop.genshin.dungeon.studio"
      + delete_time           = (known after apply)
      + etag                  = (known after apply)
      + expire_time           = (known after apply)
      + host_state            = (known after apply)
      + id                    = (known after apply)
      + issues                = (known after apply)
      + name                  = (known after apply)
      + ownership_state       = (known after apply)
      + project               = "dungeon-studio-genshin-dev"
      + reconciling           = (known after apply)
      + required_dns_updates  = (known after apply)
      + site_id               = "dungeon-studio-genshin-dev"
      + update_time           = (known after apply)
      + wait_dns_verification = false
    }

  # google_firebase_hosting_site.web will be created
  + resource "google_firebase_hosting_site" "web" {
      + default_url = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "dungeon-studio-genshin-dev"
      + site_id     = "dungeon-studio-genshin-dev"
      + type        = (known after apply)
    }

  # google_identity_platform_config.default will be updated in-place
  ~ resource "google_identity_platform_config" "default" {
        id                         = "projects/dungeon-studio-genshin-dev/config"
        name                       = "projects/179636804167/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # google_project_service.firebase_hosting will be created
  + resource "google_project_service" "firebase_hosting" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "dungeon-studio-genshin-dev"
      + service            = "firebasehosting.googleapis.com"
    }

  # google_project_service.storage will be destroyed
  # (because google_project_service.storage is not in configuration)
  - resource "google_project_service" "storage" {
      - disable_on_destroy = false -> null
      - id                 = "dungeon-studio-genshin-dev/storage.googleapis.com" -> null
      - project            = "dungeon-studio-genshin-dev" -> null
      - service            = "storage.googleapis.com" -> null
    }

  # google_storage_bucket.web will be destroyed
  # (because google_storage_bucket.web is not in configuration)
  - resource "google_storage_bucket" "web" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "environment"                = "dev"
          - "goog-terraform-provisioned" = "true"
          - "managed_by"                 = "terraform"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = false -> null
      - id                          = "develop.genshin.dungeon.studio" -> null
      - labels                      = {
          - "environment" = "dev"
          - "managed_by"  = "terraform"
        } -> null
      - location                    = "EU" -> null
      - name                        = "develop.genshin.dungeon.studio" -> null
      - project                     = "dungeon-studio-genshin-dev" -> null
      - project_number              = 179636804167 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/develop.genshin.dungeon.studio" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "environment"                = "dev"
          - "goog-terraform-provisioned" = "true"
          - "managed_by"                 = "terraform"
        } -> null
      - time_created                = "2026-02-17T20:19:07.634Z" -> null
      - uniform_bucket_level_access = false -> null
      - updated                     = "2026-02-17T20:19:09.846Z" -> null
      - url                         = "gs://develop.genshin.dungeon.studio" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - effective_time             = "2026-02-17T20:19:07.634Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - website {
          - main_page_suffix = "index.html" -> null
          - not_found_page   = "index.html" -> null
        }
    }

  # google_storage_bucket_iam_binding.public_read will be destroyed
  # (because google_storage_bucket_iam_binding.public_read is not in configuration)
  - resource "google_storage_bucket_iam_binding" "public_read" {
      - bucket  = "b/develop.genshin.dungeon.studio" -> null
      - etag    = "CAI=" -> null
      - id      = "b/develop.genshin.dungeon.studio/roles/storage.objectViewer" -> null
      - members = [
          - "allUsers",
        ] -> null
      - role    = "roles/storage.objectViewer" -> null
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  - web_bucket_name            = "develop.genshin.dungeon.studio" -> null
  + web_hosting_site_id        = "dungeon-studio-genshin-dev"

```
</details>